testhound/alo/llir/octave/m480/M480Instructions.cpp

#include <iostream>
using namespace std;

#include <LlirException.h>

#include "M480Instructions.h"
#include "M480Visitor.h"


namespace Llir {
  
  
  //---------------------------------------------
  // M480AddwhInstruction
  //---------------------------------------------
  
  M480AddwhInstruction&
  M480AddwhInstruction::operator=(const M480AddwhInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddwhInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddwhInstruction dynRhs = 
      dynamic_cast<const M480AddwhInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480AddwhInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
    
  //---------------------------------------------
  // M480JaddwhInstruction
  //---------------------------------------------
  

  bool 
  M480JaddwhInstruction::isPseudoInsn() const
  {
    return true;
  }

  M480JaddwhInstruction&
  M480JaddwhInstruction::operator=(const M480JaddwhInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JaddwhInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JaddwhInstruction dynRhs = 
      dynamic_cast<const M480JaddwhInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JaddwhInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480AddwlInstruction
  //---------------------------------------------
  
  M480AddwlInstruction&
  M480AddwlInstruction::operator=(const M480AddwlInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddwlInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddwlInstruction dynRhs = 
      dynamic_cast<const M480AddwlInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480AddwlInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
    
  //---------------------------------------------
  // M480JaddwlInstruction
  //---------------------------------------------


  bool 
  M480JaddwlInstruction::isPseudoInsn() const
  {
    return true;
  }

  M480JaddwlInstruction&
  M480JaddwlInstruction::operator=(const M480JaddwlInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JaddwlInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JaddwlInstruction dynRhs = 
      dynamic_cast<const M480JaddwlInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JaddwlInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480AddwwInstruction
  //---------------------------------------------
  
  M480AddwwInstruction&
  M480AddwwInstruction::operator=(const M480AddwwInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddwwInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddwwInstruction dynRhs = 
      dynamic_cast<const M480AddwwInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480AddwwInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  

  
  //---------------------------------------------
  // M480JaddwwInstruction
  //---------------------------------------------
  

  bool 
  M480JaddwwInstruction::isPseudoInsn() const
  {
    return true;
  }

  M480JaddwwInstruction&
  M480JaddwwInstruction::operator=(const M480JaddwwInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JaddwwInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JaddwwInstruction dynRhs = 
      dynamic_cast<const M480JaddwwInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JaddwwInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
