testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
    

  //---------------------------------------------
  // M480AddlInstruction
  //---------------------------------------------
  
  M480AddlInstruction&
  M480AddlInstruction::operator=(const M480AddlInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddlInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddlInstruction dynRhs = 
      dynamic_cast<const M480AddlInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480AddlInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
   
  //---------------------------------------------
  // M480JaddlInstruction
  //---------------------------------------------
  

  bool 
  M480JaddlInstruction::isPseudoInsn() const
  {
    return true;
  }


  M480JaddlInstruction&
  M480JaddlInstruction::operator=(const M480JaddlInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JaddlInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JaddlInstruction dynRhs = 
      dynamic_cast<const M480JaddlInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JaddlInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480SubwhInstruction
  //---------------------------------------------
  


  M480SubwhInstruction&
  M480SubwhInstruction::operator=(const M480SubwhInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SubwhInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SubwhInstruction dynRhs = 
      dynamic_cast<const M480SubwhInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480SubwhInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
    
  //---------------------------------------------
  // M480JsubwhInstruction
  //---------------------------------------------
  

  bool 
  M480JsubwhInstruction::isPseudoInsn() const
  {
    return true;
  }


  M480JsubwhInstruction&
  M480JsubwhInstruction::operator=(const M480JsubwhInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JsubwhInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JsubwhInstruction dynRhs = 
      dynamic_cast<const M480JsubwhInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JsubwhInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480SubwlInstruction
  //---------------------------------------------
  

  M480SubwlInstruction&
  M480SubwlInstruction::operator=(const M480SubwlInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SubwlInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SubwlInstruction dynRhs = 
      dynamic_cast<const M480SubwlInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480SubwlInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
    
  //---------------------------------------------
  // M480JsubwlInstruction
  //---------------------------------------------


  bool 
  M480JsubwlInstruction::isPseudoInsn() const
  {
    return true;
  }
  
  M480JsubwlInstruction&
  M480JsubwlInstruction::operator=(const M480JsubwlInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JsubwlInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JsubwlInstruction dynRhs = 
      dynamic_cast<const M480JsubwlInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JsubwlInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
