testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  //---------------------------------------------
  // M480SubwwInstruction
  //---------------------------------------------
  
  M480SubwwInstruction&
  M480SubwwInstruction::operator=(const M480SubwwInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SubwwInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SubwwInstruction dynRhs = 
      dynamic_cast<const M480SubwwInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480SubwwInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
    
  //---------------------------------------------
  // M480JsubwwInstruction
  //---------------------------------------------
  

  bool 
  M480JsubwwInstruction::isPseudoInsn() const
  {
    return true;
  }

  M480JsubwwInstruction&
  M480JsubwwInstruction::operator=(const M480JsubwwInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JsubwwInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JsubwwInstruction dynRhs = 
      dynamic_cast<const M480JsubwwInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JsubwwInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480SublInstruction
  //---------------------------------------------
  
  M480SublInstruction&
  M480SublInstruction::operator=(const M480SublInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SublInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SublInstruction dynRhs = 
      dynamic_cast<const M480SublInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480SublInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
    
  //---------------------------------------------
  // M480JsublInstruction
  //---------------------------------------------
  

  bool 
  M480JsublInstruction::isPseudoInsn() const
  {
    return true;
  }


  M480JsublInstruction&
  M480JsublInstruction::operator=(const M480JsublInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JsublInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JsublInstruction dynRhs = 
      dynamic_cast<const M480JsublInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JsublInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480AddwhiInstruction
  //---------------------------------------------
  
  M480AddwhiInstruction&
  M480AddwhiInstruction::operator=(const M480AddwhiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddwhiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddwhiInstruction dynRhs = 
      dynamic_cast<const M480AddwhiInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480AddwhiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
   
  //---------------------------------------------
  // M480JaddwhiInstruction
  //---------------------------------------------
  

  bool 
  M480JaddwhiInstruction::isPseudoInsn() const
  {
    return true;
  }


  M480JaddwhiInstruction&
  M480JaddwhiInstruction::operator=(const M480JaddwhiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JaddwhiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JaddwhiInstruction dynRhs = 
      dynamic_cast<const M480JaddwhiInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JaddwhiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
