testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480AddwliInstruction
  //---------------------------------------------
  
  M480AddwliInstruction&
  M480AddwliInstruction::operator=(const M480AddwliInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddwliInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddwliInstruction dynRhs = 
      dynamic_cast<const M480AddwliInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480AddwliInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480JaddwliInstruction
  //---------------------------------------------
  

  bool 
  M480JaddwliInstruction::isPseudoInsn() const
  {
    return true;
  }


  M480JaddwliInstruction&
  M480JaddwliInstruction::operator=(const M480JaddwliInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JaddwliInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JaddwliInstruction dynRhs = 
      dynamic_cast<const M480JaddwliInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JaddwliInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480AddwwiInstruction
  //---------------------------------------------
  
  M480AddwwiInstruction&
  M480AddwwiInstruction::operator=(const M480AddwwiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddwwiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddwwiInstruction dynRhs = 
      dynamic_cast<const M480AddwwiInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480AddwwiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
    
  //---------------------------------------------
  // M480JaddwwiInstruction
  //---------------------------------------------
  

  bool 
  M480JaddwwiInstruction::isPseudoInsn() const
  {
    return true;
  }

  M480JaddwwiInstruction&
  M480JaddwwiInstruction::operator=(const M480JaddwwiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JaddwwiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JaddwwiInstruction dynRhs = 
      dynamic_cast<const M480JaddwwiInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JaddwwiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480AddliInstruction
  //---------------------------------------------
  
  M480AddliInstruction&
  M480AddliInstruction::operator=(const M480AddliInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddliInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddliInstruction dynRhs = 
      dynamic_cast<const M480AddliInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480AddliInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
   
  //---------------------------------------------
  // M480JaddliInstruction
  //---------------------------------------------
  

  bool 
  M480JaddliInstruction::isPseudoInsn() const
  {
    return true;
  }

  M480JaddliInstruction&
  M480JaddliInstruction::operator=(const M480JaddliInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JaddliInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JaddliInstruction dynRhs = 
      dynamic_cast<const M480JaddliInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JaddliInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
