testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480SubwhiInstruction
  //---------------------------------------------
  
  M480SubwhiInstruction&
  M480SubwhiInstruction::operator=(const M480SubwhiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SubwhiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SubwhiInstruction dynRhs = 
      dynamic_cast<const M480SubwhiInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480SubwhiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
   
  //---------------------------------------------
  // M480JsubwhiInstruction
  //---------------------------------------------
  

  bool 
  M480JsubwhiInstruction::isPseudoInsn() const
  {
    return true;
  }

 
  M480JsubwhiInstruction&
  M480JsubwhiInstruction::operator=(const M480JsubwhiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JsubwhiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JsubwhiInstruction dynRhs = 
      dynamic_cast<const M480JsubwhiInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JsubwhiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480SubwliInstruction
  //---------------------------------------------
  
  M480SubwliInstruction&
  M480SubwliInstruction::operator=(const M480SubwliInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SubwliInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SubwliInstruction dynRhs = 
      dynamic_cast<const M480SubwliInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480SubwliInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480JsubwliInstruction
  //---------------------------------------------
  

  bool 
  M480JsubwliInstruction::isPseudoInsn() const
  {
    return true;
  }


  M480JsubwliInstruction&
  M480JsubwliInstruction::operator=(const M480JsubwliInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JsubwliInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JsubwliInstruction dynRhs = 
      dynamic_cast<const M480JsubwliInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JsubwliInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  

  
  //---------------------------------------------
  // M480SubwwiInstruction
  //---------------------------------------------
  
  M480SubwwiInstruction&
  M480SubwwiInstruction::operator=(const M480SubwwiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SubwwiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SubwwiInstruction dynRhs = 
      dynamic_cast<const M480SubwwiInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480SubwwiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480JsubwwiInstruction
  //---------------------------------------------
  

  bool 
  M480JsubwwiInstruction::isPseudoInsn() const
  {
    return true;
  }

  M480JsubwwiInstruction&
  M480JsubwwiInstruction::operator=(const M480JsubwwiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JsubwwiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JsubwwiInstruction dynRhs = 
      dynamic_cast<const M480JsubwwiInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JsubwwiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
