testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  


  
  //---------------------------------------------
  // M480SubliInstruction
  //---------------------------------------------
  
  M480SubliInstruction&
  M480SubliInstruction::operator=(const M480SubliInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SubliInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SubliInstruction dynRhs = 
      dynamic_cast<const M480SubliInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480SubliInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  

  
  //---------------------------------------------
  // M480JsubliInstruction
  //---------------------------------------------
  

  bool 
  M480JsubliInstruction::isPseudoInsn() const
  {
    return true;
  }


  M480JsubliInstruction&
  M480JsubliInstruction::operator=(const M480JsubliInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JsubliInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JsubliInstruction dynRhs = 
      dynamic_cast<const M480JsubliInstruction&> (rhs); 
    return (    (getLineNum()      == dynRhs.getLineNum()     )
	     && (getSrc1()         == dynRhs.getSrc1()        )
	     && (getDst()          == dynRhs.getDst()         )
	     && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JsubliInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  


  //---------------------------------------------
  // M480FfsInstruction
  //---------------------------------------------
  
  M480FfsInstruction&
  M480FfsInstruction::operator=(const M480FfsInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpFindInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480FfsInstruction::equalTo(const LlirNode& rhs) const
  {
    M480FfsInstruction dynRhs = 
      dynamic_cast<const M480FfsInstruction&> (rhs); 
    return (    (getLineNum()  == dynRhs.getLineNum() )
	     && (getSrc1()     == dynRhs.getSrc1()    )
	     && (getDst()      == dynRhs.getDst()     )
	     && (getAbcFlag()  == dynRhs.getAbcFlag() )
	     && (getFindFlag() == dynRhs.getFindFlag()) );
  }
  
  void 
  M480FfsInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480FlsInstruction
  //---------------------------------------------
  
  M480FlsInstruction&
  M480FlsInstruction::operator=(const M480FlsInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpFindInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480FlsInstruction::equalTo(const LlirNode& rhs) const
  {
    M480FlsInstruction dynRhs = 
      dynamic_cast<const M480FlsInstruction&> (rhs); 
    return (    (getLineNum()  == dynRhs.getLineNum() )
	     && (getSrc1()     == dynRhs.getSrc1()    )
	     && (getDst()      == dynRhs.getDst()     )
	     && (getAbcFlag()  == dynRhs.getAbcFlag() )
	     && (getFindFlag() == dynRhs.getFindFlag()) );
  }
  
  void 
  M480FlsInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480ParInstruction
  //---------------------------------------------
 

  bool 
   M480ParInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480ParInstruction::getNumDelaySlots() const
  {
    if(hasValidAbcFlag())
      {
        return 3;
      }
    else
      {
        return 0;
      }
  }

  bool
  M480ParInstruction::isAbcInsn() const
  {
    if(hasValidAbcFlag())
      {
        return true;
      }
    else
      {
        return false;
      }
  }

  bool
  M480ParInstruction::isBranchInsn() const
  {
    if(hasValidAbcFlag())
      {
        return true;
      }
    else
      {
        return false;
      }
  }
  
  bool
  M480ParInstruction::isValidDslotInsn() const
  {
    if(hasValidAbcFlag())
      {
        return false;
      }
    else
      {
        return true;
      }
  }
     
  bool
  M480ParInstruction::hasValidAbcFlag() const
  {
    shared_ptr<const LlirOperand> opnd = getAbcFlag();

    shared_ptr<const OpndNull> nullOpnd = shared_dynamic_cast<const OpndNull>(opnd);

    if(nullOpnd)
      {
        return false;
      }
    else
      {
        return true;
      }
  }


  OpndPtr
  M480ParInstruction::getAbcFlag() const
  {
    return m_abcFlag;
  }
  
  M480ParInstruction&
  M480ParInstruction::operator=(const M480ParInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpInstruction::operator=(rhs);
    m_abcFlag  = rhs.m_abcFlag;
    return *this;
    
  }
  
  bool
  M480ParInstruction::equalTo(const LlirNode& rhs) const
  {
    M480ParInstruction dynRhs = 
      dynamic_cast<const M480ParInstruction&> (rhs); 
    return (    (getLineNum()  == dynRhs.getLineNum())
	     && (getSrc1()     == dynRhs.getSrc1()   )
	     && (getDst()      == dynRhs.getDst()    )
	     && (getAbcFlag()  == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480ParInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
