testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480AddInstruction
  //---------------------------------------------
  
  M480AddInstruction&
  M480AddInstruction::operator=(const M480AddInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddInstruction dynRhs = 
      dynamic_cast<const M480AddInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag())
	     && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480AddInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480Add4xInstruction
  //---------------------------------------------
  
  M480Add4xInstruction&
  M480Add4xInstruction::operator=(const M480Add4xInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480Add4xInstruction::equalTo(const LlirNode& rhs) const
  {
    M480Add4xInstruction dynRhs = 
      dynamic_cast<const M480Add4xInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480Add4xInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480AddcInstruction
  //---------------------------------------------
  
  M480AddcInstruction&
  M480AddcInstruction::operator=(const M480AddcInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddcInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddcInstruction dynRhs = 
      dynamic_cast<const M480AddcInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480AddcInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480AndInstruction
  //---------------------------------------------
  
  M480AndInstruction&
  M480AndInstruction::operator=(const M480AndInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AndInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AndInstruction dynRhs = 
      dynamic_cast<const M480AndInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480AndInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480MaxInstruction
  //---------------------------------------------
  
  M480MaxInstruction&
  M480MaxInstruction::operator=(const M480MaxInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480MaxInstruction::equalTo(const LlirNode& rhs) const
  {
    M480MaxInstruction dynRhs = 
      dynamic_cast<const M480MaxInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480MaxInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480MinInstruction
  //---------------------------------------------
  
  M480MinInstruction&
  M480MinInstruction::operator=(const M480MinInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480MinInstruction::equalTo(const LlirNode& rhs) const
  {
    M480MinInstruction dynRhs = 
      dynamic_cast<const M480MinInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480MinInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
