testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480OrInstruction
  //---------------------------------------------
  
  M480OrInstruction&
  M480OrInstruction::operator=(const M480OrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480OrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480OrInstruction dynRhs = 
      dynamic_cast<const M480OrInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480OrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480SubInstruction
  //---------------------------------------------
  
  M480SubInstruction&
  M480SubInstruction::operator=(const M480SubInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SubInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SubInstruction dynRhs = 
      dynamic_cast<const M480SubInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480SubInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480SubbInstruction
  //---------------------------------------------
  
  M480SubbInstruction&
  M480SubbInstruction::operator=(const M480SubbInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SubbInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SubbInstruction dynRhs = 
      dynamic_cast<const M480SubbInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480SubbInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480XorInstruction
  //---------------------------------------------
  
  M480XorInstruction&
  M480XorInstruction::operator=(const M480XorInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480XorInstruction::equalTo(const LlirNode& rhs) const
  {
    M480XorInstruction dynRhs = 
      dynamic_cast<const M480XorInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480XorInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480AddiInstruction
  //---------------------------------------------
  
  M480AddiInstruction&
  M480AddiInstruction::operator=(const M480AddiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddiInstruction dynRhs = 
      dynamic_cast<const M480AddiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480AddiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480AddciInstruction
  //---------------------------------------------
  
  M480AddciInstruction&
  M480AddciInstruction::operator=(const M480AddciInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddciInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddciInstruction dynRhs = 
      dynamic_cast<const M480AddciInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480AddciInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
