testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480SubiInstruction
  //---------------------------------------------
  
  M480SubiInstruction&
  M480SubiInstruction::operator=(const M480SubiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SubiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SubiInstruction dynRhs = 
      dynamic_cast<const M480SubiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480SubiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480SubbiInstruction
  //---------------------------------------------
  
  M480SubbiInstruction&
  M480SubbiInstruction::operator=(const M480SubbiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcModInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SubbiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SubbiInstruction dynRhs = 
      dynamic_cast<const M480SubbiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
             && (getSrc1()    == dynRhs.getSrc1()   )
             && (getSrc2()    == dynRhs.getSrc2()   )
             && (getDst()     == dynRhs.getDst()    )
             && (getAbcFlag() == dynRhs.getAbcFlag())
             && (getModFlag() == dynRhs.getModFlag()) );
  }
  
  void 
  M480SubbiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480RandInstruction
  //---------------------------------------------
  
  M480RandInstruction&
  M480RandInstruction::operator=(const M480RandInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480RandInstruction::equalTo(const LlirNode& rhs) const
  {
    M480RandInstruction dynRhs = 
      dynamic_cast<const M480RandInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480RandInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480RotlInstruction
  //---------------------------------------------
  
  M480RotlInstruction&
  M480RotlInstruction::operator=(const M480RotlInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480RotlInstruction::equalTo(const LlirNode& rhs) const
  {
    M480RotlInstruction dynRhs = 
      dynamic_cast<const M480RotlInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480RotlInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480RotrInstruction
  //---------------------------------------------
  
  M480RotrInstruction&
  M480RotrInstruction::operator=(const M480RotrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480RotrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480RotrInstruction dynRhs = 
      dynamic_cast<const M480RotrInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480RotrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480ClrbInstruction
  //---------------------------------------------
  
  M480ClrbInstruction&
  M480ClrbInstruction::operator=(const M480ClrbInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480ClrbInstruction::equalTo(const LlirNode& rhs) const
  {
    M480ClrbInstruction dynRhs = 
      dynamic_cast<const M480ClrbInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480ClrbInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
