testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480SetbInstruction
  //---------------------------------------------
  
  M480SetbInstruction&
  M480SetbInstruction::operator=(const M480SetbInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480SetbInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SetbInstruction dynRhs = 
      dynamic_cast<const M480SetbInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480SetbInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480ShftInstruction
  //---------------------------------------------
  
  M480ShftInstruction&
  M480ShftInstruction::operator=(const M480ShftInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480ShftInstruction::equalTo(const LlirNode& rhs) const
  {
    M480ShftInstruction dynRhs = 
      dynamic_cast<const M480ShftInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480ShftInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480ShftaInstruction
  //---------------------------------------------
  
  M480ShftaInstruction&
  M480ShftaInstruction::operator=(const M480ShftaInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480ShftaInstruction::equalTo(const LlirNode& rhs) const
  {
    M480ShftaInstruction dynRhs = 
      dynamic_cast<const M480ShftaInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480ShftaInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480ShlInstruction
  //---------------------------------------------
  
  M480ShlInstruction&
  M480ShlInstruction::operator=(const M480ShlInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480ShlInstruction::equalTo(const LlirNode& rhs) const
  {
    M480ShlInstruction dynRhs = 
      dynamic_cast<const M480ShlInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480ShlInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480ShrInstruction
  //---------------------------------------------
  
  M480ShrInstruction&
  M480ShrInstruction::operator=(const M480ShrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480ShrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480ShrInstruction dynRhs = 
      dynamic_cast<const M480ShrInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480ShrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480ShraInstruction
  //---------------------------------------------
  
  M480ShraInstruction&
  M480ShraInstruction::operator=(const M480ShraInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480ShraInstruction::equalTo(const LlirNode& rhs) const
  {
    M480ShraInstruction dynRhs = 
      dynamic_cast<const M480ShraInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480ShraInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
