testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480ShriInstruction
  //---------------------------------------------
  
  M480ShriInstruction&
  M480ShriInstruction::operator=(const M480ShriInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480ShriInstruction::equalTo(const LlirNode& rhs) const
  {
    M480ShriInstruction dynRhs = 
      dynamic_cast<const M480ShriInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480ShriInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480ShraiInstruction
  //---------------------------------------------
  
  M480ShraiInstruction&
  M480ShraiInstruction::operator=(const M480ShraiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480ShraiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480ShraiInstruction dynRhs = 
      dynamic_cast<const M480ShraiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480ShraiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480MaxiInstruction
  //---------------------------------------------
  
  M480MaxiInstruction&
  M480MaxiInstruction::operator=(const M480MaxiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480MaxiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480MaxiInstruction dynRhs = 
      dynamic_cast<const M480MaxiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480MaxiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480MiniInstruction
  //---------------------------------------------
  
  M480MiniInstruction&
  M480MiniInstruction::operator=(const M480MiniInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480MiniInstruction::equalTo(const LlirNode& rhs) const
  {
    M480MiniInstruction dynRhs = 
      dynamic_cast<const M480MiniInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480MiniInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480AndiInstruction
  //---------------------------------------------
  
  M480AndiInstruction&
  M480AndiInstruction::operator=(const M480AndiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AndiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AndiInstruction dynRhs = 
      dynamic_cast<const M480AndiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480AndiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480OriInstruction
  //---------------------------------------------
  
  M480OriInstruction&
  M480OriInstruction::operator=(const M480OriInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480OriInstruction::equalTo(const LlirNode& rhs) const
  {
    M480OriInstruction dynRhs = 
      dynamic_cast<const M480OriInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480OriInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
