testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480XoriInstruction
  //---------------------------------------------
  
  M480XoriInstruction&
  M480XoriInstruction::operator=(const M480XoriInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpAbcInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480XoriInstruction::equalTo(const LlirNode& rhs) const
  {
    M480XoriInstruction dynRhs = 
      dynamic_cast<const M480XoriInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getAbcFlag() == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480XoriInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480MulInstruction
  //---------------------------------------------
  
  M480MulInstruction&
  M480MulInstruction::operator=(const M480MulInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpSxInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480MulInstruction::equalTo(const LlirNode& rhs) const
  {
    M480MulInstruction dynRhs = 
      dynamic_cast<const M480MulInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getSxFlag()  == dynRhs.getSxFlag() ) );
  }
  
  void 
  M480MulInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480MulhInstruction
  //---------------------------------------------
  
  M480MulhInstruction&
  M480MulhInstruction::operator=(const M480MulhInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpSxInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480MulhInstruction::equalTo(const LlirNode& rhs) const
  {
    M480MulhInstruction dynRhs = 
      dynamic_cast<const M480MulhInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getSxFlag()  == dynRhs.getSxFlag() ) );
  }
  
  void 
  M480MulhInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480MuliInstruction
  //---------------------------------------------
  
  M480MuliInstruction&
  M480MuliInstruction::operator=(const M480MuliInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpSxInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480MuliInstruction::equalTo(const LlirNode& rhs) const
  {
    M480MuliInstruction dynRhs = 
      dynamic_cast<const M480MuliInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getSxFlag()  == dynRhs.getSxFlag() ) );
  }
  
  void 
  M480MuliInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480MulhiInstruction
  //---------------------------------------------
  
  M480MulhiInstruction&
  M480MulhiInstruction::operator=(const M480MulhiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpSxInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480MulhiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480MulhiInstruction dynRhs = 
      dynamic_cast<const M480MulhiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getSxFlag()  == dynRhs.getSxFlag() ) );
  }
  
  void 
  M480MulhiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480AddneInstruction
  //---------------------------------------------


  bool 
  M480AddneInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480AddneInstruction::getNumDelaySlots() const
  {
    return 0;
  }

  bool
  M480AddneInstruction::isAbcInsn() const
  {
    return false;
  }

  bool
  M480AddneInstruction::isValidDslotInsn() const
  {
    return true;
  }

  M480AddneInstruction&
  M480AddneInstruction::operator=(const M480AddneInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddneInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddneInstruction dynRhs = 
      dynamic_cast<const M480AddneInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    ) );
  }
  
  void 
  M480AddneInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
