testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480AddneiInstruction
  //---------------------------------------------

  bool 
  M480AddneiInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480AddneiInstruction::getNumDelaySlots() const
  {
    return 0;
  }

  bool
  M480AddneiInstruction::isAbcInsn() const
  {
    return false;
  }

  bool
  M480AddneiInstruction::isValidDslotInsn() const
  {
    return true;
  }

  M480AddneiInstruction&
  M480AddneiInstruction::operator=(const M480AddneiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu3OpInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480AddneiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480AddneiInstruction dynRhs = 
      dynamic_cast<const M480AddneiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getDst()     == dynRhs.getDst()    ) );
  }
  
  void 
  M480AddneiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480ByteswInstruction
  //---------------------------------------------

  bool 
  M480ByteswInstruction::isPseudoInsn() const
  {
    return false;
  }

   unsigned int
  M480ByteswInstruction::getNumDelaySlots() const
  {
    if(hasValidAbcFlag())
      {
        return 3;
      }
    else
      {
        return 0;
      }
  }

  bool
  M480ByteswInstruction::isAbcInsn() const
  {
    if(hasValidAbcFlag())
      {
        return true;
      }
    else
      {
        return false;
      }
  }

  bool
  M480ByteswInstruction::isValidDslotInsn() const
  {
    return true;
  }

  bool
  M480ByteswInstruction::hasValidAbcFlag() const
  {
    shared_ptr<const LlirOperand> opnd = getAbcFlag();

    shared_ptr<const OpndNull> nullOpnd = shared_dynamic_cast<const OpndNull>(opnd);

    if(nullOpnd)
      {
        return false;
      }
    else
      {
        return true;
      }
  }


  RegPtr
  M480ByteswInstruction::getSrc1() const
  {
    return m_src1;
  }
  
  RegPtr
  M480ByteswInstruction::getDst() const
  {
    return m_dst;
  }
  
  UImmPtr
  M480ByteswInstruction::getB0() const
  {
    return m_b0;
  }
  
  UImmPtr
  M480ByteswInstruction::getB1() const
  {
    return m_b1;
  }
  
  UImmPtr
  M480ByteswInstruction::getB2() const
  {
    return m_b2;
  }
  
  UImmPtr
  M480ByteswInstruction::getB3() const
  {
    return m_b3;
  }
  
  OpndPtr
  M480ByteswInstruction::getAbcFlag() const
  {
    return m_abcFlag;
  }
  
  M480ByteswInstruction&
  M480ByteswInstruction::operator=(const M480ByteswInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    AluOpInstruction::operator=(rhs);
    m_src1 = rhs.m_src1;
    m_dst = rhs.m_dst;
    m_b0 = rhs.m_b0;
    m_b1 = rhs.m_b1;
    m_b2 = rhs.m_b2;
    m_b3 = rhs.m_b3;
    m_abcFlag  = rhs.m_abcFlag;
    return *this;
    
  }
  
  bool
  M480ByteswInstruction::equalTo(const LlirNode& rhs) const
  {
    M480ByteswInstruction dynRhs = 
      dynamic_cast<const M480ByteswInstruction&> (rhs); 
    return (    (getLineNum()  == dynRhs.getLineNum())
	     && (getSrc1()     == dynRhs.getSrc1()   )
	     && (getDst()      == dynRhs.getDst()    )
	     && (getB0()       == dynRhs.getB0()     )
	     && (getB1()       == dynRhs.getB1()     )
	     && (getB2()       == dynRhs.getB2()     )
	     && (getB3()       == dynRhs.getB3()     )
	     && (getAbcFlag()  == dynRhs.getAbcFlag()) );
  }
  
  void 
  M480ByteswInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480DepbInstruction
  //---------------------------------------------

  OpndPtr
  M480DepbInstruction::getDepbFlag() const
  {
    return m_depbFlag;
  }
  
  M480DepbInstruction&
  M480DepbInstruction::operator=(const M480DepbInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BitOpInstruction::operator=(rhs);
    m_depbFlag = rhs.m_depbFlag;
    return *this;
    
  }
  
  bool
  M480DepbInstruction::equalTo(const LlirNode& rhs) const
  {
    M480DepbInstruction dynRhs = 
      dynamic_cast<const M480DepbInstruction&> (rhs); 
    return (   (getLineNum()   == dynRhs.getLineNum()  )
            && (getSrc1()      == dynRhs.getSrc1()     )
            && (getSrcBitNum() == dynRhs.getSrcBitNum())
            && (getDst()       == dynRhs.getDst()      ) 
            && (getDstBitNum() == dynRhs.getDstBitNum()) 
            && (getNumBits()   == dynRhs.getNumBits()  )
	    && (getDepbFlag()  == dynRhs.getDepbFlag() ) );
  }
  
  void 
  M480DepbInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480ExtbInstruction
  //---------------------------------------------
  
  OpndPtr
  M480ExtbInstruction::getSignFlag() const
  {
    return m_sign;
  }
  
  M480ExtbInstruction&
  M480ExtbInstruction::operator=(const M480ExtbInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BitOpInstruction::operator=(rhs);
    m_sign = rhs.m_sign;
    return *this;
    
  }
  
  bool
  M480ExtbInstruction::equalTo(const LlirNode& rhs) const
  {
    M480ExtbInstruction dynRhs = 
      dynamic_cast<const M480ExtbInstruction&> (rhs); 
    return (   (getLineNum()   == dynRhs.getLineNum()  )
            && (getSrc1()      == dynRhs.getSrc1()     )
            && (getSrcBitNum() == dynRhs.getSrcBitNum())
            && (getDst()       == dynRhs.getDst()      ) 
            && (getDstBitNum() == dynRhs.getDstBitNum()) 
            && (getNumBits()   == dynRhs.getNumBits()  )
	    && (getSignFlag()  == dynRhs.getSignFlag() ) );
  }
  
  void 
  M480ExtbInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
