testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480DepbiInstruction
  //---------------------------------------------
  
  OpndPtr
  M480DepbiInstruction::getDepbFlag() const
  {
    return m_depbFlag;
  }
  
  M480DepbiInstruction&
  M480DepbiInstruction::operator=(const M480DepbiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BitOpImmInstruction::operator=(rhs);
    m_depbFlag = rhs.m_depbFlag;
    return *this;
    
  }
  
  bool
  M480DepbiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480DepbiInstruction dynRhs = 
      dynamic_cast<const M480DepbiInstruction&> (rhs); 
    return (   (getLineNum()   == dynRhs.getLineNum()  )
            && (getSrc1()      == dynRhs.getSrc1()     )
            && (getDst()       == dynRhs.getDst()      ) 
            && (getDstBitNum() == dynRhs.getDstBitNum()) 
            && (getNumBits()   == dynRhs.getNumBits()  )
	    && (getDepbFlag()  == dynRhs.getDepbFlag() ) );
  }
  
  void 
  M480DepbiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480CmovInstruction
  //---------------------------------------------
  
  M480CmovInstruction&
  M480CmovInstruction::operator=(const M480CmovInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CmovOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480CmovInstruction::equalTo(const LlirNode& rhs) const
  {
    M480CmovInstruction dynRhs = 
      dynamic_cast<const M480CmovInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum())
            && (getSrc1()     == dynRhs.getSrc1()   )
            && (getSrc2()     == dynRhs.getSrc2()   )
            && (getDst()      == dynRhs.getDst()    ) 
	    && (getEssFlag()  == dynRhs.getEssFlag()) );
  }
  
  void 
  M480CmovInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480CmoviInstruction
  //---------------------------------------------
  
  M480CmoviInstruction&
  M480CmoviInstruction::operator=(const M480CmoviInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CmovOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480CmoviInstruction::equalTo(const LlirNode& rhs) const
  {
    M480CmoviInstruction dynRhs = 
      dynamic_cast<const M480CmoviInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum())
            && (getSrc1()     == dynRhs.getSrc1()   )
            && (getSrc2()     == dynRhs.getSrc2()   )
            && (getDst()      == dynRhs.getDst()    ) 
	    && (getEssFlag()  == dynRhs.getEssFlag()) );
  }
  
  void 
  M480CmoviInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480DmapInstruction
  //---------------------------------------------
  
  M480DmapInstruction&
  M480DmapInstruction::operator=(const M480DmapInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    DmaOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480DmapInstruction::equalTo(const LlirNode& rhs) const
  {
    M480DmapInstruction dynRhs = 
      dynamic_cast<const M480DmapInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
	    && (getDmaFlags() == dynRhs.getDmaFlags()) );
  }
  
  void 
  M480DmapInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480DmasrInstruction
  //---------------------------------------------
  
  M480DmasrInstruction&
  M480DmasrInstruction::operator=(const M480DmasrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    DmaOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480DmasrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480DmasrInstruction dynRhs = 
      dynamic_cast<const M480DmasrInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
	    && (getDmaFlags() == dynRhs.getDmaFlags()) );
  }
  
  void 
  M480DmasrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480Dmau0Instruction
  //---------------------------------------------
  
  M480Dmau0Instruction&
  M480Dmau0Instruction::operator=(const M480Dmau0Instruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    DmaOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480Dmau0Instruction::equalTo(const LlirNode& rhs) const
  {
    M480Dmau0Instruction dynRhs = 
      dynamic_cast<const M480Dmau0Instruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
	    && (getDmaFlags() == dynRhs.getDmaFlags()) );
  }
  
  void 
  M480Dmau0Instruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
