testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480Dmau1Instruction
  //---------------------------------------------
  
  M480Dmau1Instruction&
  M480Dmau1Instruction::operator=(const M480Dmau1Instruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    DmaOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480Dmau1Instruction::equalTo(const LlirNode& rhs) const
  {
    M480Dmau1Instruction dynRhs = 
      dynamic_cast<const M480Dmau1Instruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
	    && (getDmaFlags() == dynRhs.getDmaFlags()) );
  }
  
  void 
  M480Dmau1Instruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480LihInstruction
  //---------------------------------------------
  
  M480LihInstruction&
  M480LihInstruction::operator=(const M480LihInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    LoadImmediateInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LihInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LihInstruction dynRhs = 
      dynamic_cast<const M480LihInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getDst()     == dynRhs.getDst()    )
	    && (getSrc()     == dynRhs.getSrc()    ) );
  }
  
  void 
  M480LihInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480LilInstruction
  //---------------------------------------------
  
  M480LilInstruction&
  M480LilInstruction::operator=(const M480LilInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    LoadImmediateInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LilInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LilInstruction dynRhs = 
      dynamic_cast<const M480LilInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getDst()     == dynRhs.getDst()    )
	    && (getSrc()     == dynRhs.getSrc()    ) );
  }
  
  void 
  M480LilInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480LaihInstruction
  //---------------------------------------------
  
  M480LaihInstruction&
  M480LaihInstruction::operator=(const M480LaihInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    LoadImmediateInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LaihInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LaihInstruction dynRhs = 
      dynamic_cast<const M480LaihInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getDst()     == dynRhs.getDst()    )
	    && (getSrc()     == dynRhs.getSrc()    ) );
  }
  
  void 
  M480LaihInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480LailInstruction
  //---------------------------------------------
  
  M480LailInstruction&
  M480LailInstruction::operator=(const M480LailInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    LoadImmediateInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LailInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LailInstruction dynRhs = 
      dynamic_cast<const M480LailInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getDst()     == dynRhs.getDst()    )
	    && (getSrc()     == dynRhs.getSrc()    ) );
  }
  
  void 
  M480LailInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480LwihInstruction
  //---------------------------------------------
  
  M480LwihInstruction&
  M480LwihInstruction::operator=(const M480LwihInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    LoadHalfwordInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LwihInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LwihInstruction dynRhs = 
      dynamic_cast<const M480LwihInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getDst()     == dynRhs.getDst()    )
	    && (getSrc()     == dynRhs.getSrc()    ) );
  }
  
  void 
  M480LwihInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480LwilInstruction
  //---------------------------------------------
  
  M480LwilInstruction&
  M480LwilInstruction::operator=(const M480LwilInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    LoadHalfwordInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LwilInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LwilInstruction dynRhs = 
      dynamic_cast<const M480LwilInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getDst()     == dynRhs.getDst()    )
	    && (getSrc()     == dynRhs.getSrc()    ) );
  }
  
  void 
  M480LwilInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
