testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480NopInstruction
  //---------------------------------------------

  bool 
  M480NopInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480NopInstruction::getNumDelaySlots() const
  {
    return 0;
  }

  bool
  M480NopInstruction::isAbcInsn() const
  {
    return false;
  }

  bool
  M480NopInstruction::isValidDslotInsn() const
  {
    return true;
  }

  OctaveInstruction::BranchProbability 
  M480NopInstruction::getBranchProbability() const
  {
    return OctaveInstruction::NONE;
  }

  M480NopInstruction&
  M480NopInstruction::operator=(const M480NopInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    OctaveInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480NopInstruction::equalTo(const LlirNode& rhs) const
  {
    M480NopInstruction dynRhs = 
      dynamic_cast<const M480NopInstruction&> (rhs); 
    return (getLineNum() == dynRhs.getLineNum());
  }
  
  void 
  M480NopInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480Hec5Instruction
  //---------------------------------------------
  
  UImmPtr
  M480Hec5Instruction::getBytes() const
  {
    return m_bytes;
  }
  
  OpndPtr
  M480Hec5Instruction::getCumeFlag() const
  {
    return m_cumeFlag;
  }
  
  M480Hec5Instruction&
  M480Hec5Instruction::operator=(const M480Hec5Instruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    m_bytes        = rhs.m_bytes;
    m_cumeFlag     = rhs.m_cumeFlag;
    return *this;
    
  }
  
  bool
  M480Hec5Instruction::equalTo(const LlirNode& rhs) const
  {
    M480Hec5Instruction dynRhs = 
      dynamic_cast<const M480Hec5Instruction&> (rhs);
 
    return ((getLineNum()      == dynRhs.getLineNum())
	    && (getSrc1()          == dynRhs.getSrc1())
	    && (getDst()          == dynRhs.getDst()) 
	    && (getBytes()        == dynRhs.getBytes()) 
	    && (getBranchTarget() == dynRhs.getBranchTarget())
	    && (getCumeFlag()     == dynRhs.getCumeFlag()));
  }
  
  void 
  M480Hec5Instruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
    
  //---------------------------------------------
  // M480JHec5Instruction
  //---------------------------------------------
  
  UImmPtr
  M480JHec5Instruction::getBytes() const
  {
    return m_bytes;
  }
  
  OpndPtr
  M480JHec5Instruction::getCumeFlag() const
  {
    return m_cumeFlag;
  }
  
  M480JHec5Instruction&
  M480JHec5Instruction::operator=(const M480JHec5Instruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    Alu2OpBranchInstruction::operator=(rhs);
    m_bytes        = rhs.m_bytes;
    m_cumeFlag     = rhs.m_cumeFlag;
    return *this;
    
  }
  
  bool
  M480JHec5Instruction::equalTo(const LlirNode& rhs) const
  {
    M480JHec5Instruction dynRhs = 
      dynamic_cast<const M480JHec5Instruction&> (rhs);
 
    return ((getLineNum()      == dynRhs.getLineNum())
	    && (getSrc1()          == dynRhs.getSrc1())
	    && (getDst()          == dynRhs.getDst()) 
	    && (getBytes()        == dynRhs.getBytes()) 
	    && (getBranchTarget() == dynRhs.getBranchTarget())
	    && (getCumeFlag()     == dynRhs.getCumeFlag())
	    && (getBranchProbability() == dynRhs.getBranchProbability()));
  }
  
  void 
  M480JHec5Instruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480MvInstruction
  //---------------------------------------------

  bool 
  M480MvInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480MvInstruction::getNumDelaySlots() const
  {
    return 0;
  }

  bool
  M480MvInstruction::isAbcInsn() const
  {
    return false;
  }

  bool
  M480MvInstruction::isValidDslotInsn() const
  {
    return true;
  }

  OctaveInstruction::BranchProbability 
  M480MvInstruction::getBranchProbability() const
  {
    return OctaveInstruction::NONE;
  }


  RegPtr
  M480MvInstruction::getSrc() const
  {
    return m_src;
  }
  
  RegPtr
  M480MvInstruction::getDst() const
  {
    return m_dst;
  }
  
  M480MvInstruction&
  M480MvInstruction::operator=(const M480MvInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    OctaveInstruction::operator=(rhs);
    m_src = rhs.m_src;
    m_dst = rhs.m_dst;
    return *this;
    
  }
  
  bool
  M480MvInstruction::equalTo(const LlirNode& rhs) const
  {
    M480MvInstruction dynRhs = 
      dynamic_cast<const M480MvInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getSrc()     == dynRhs.getSrc()    )
            && (getDst()     == dynRhs.getDst()    ) );
  }
  
  void 
  M480MvInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480MvhrInstruction
  //---------------------------------------------
  
  M480MvhrInstruction&
  M480MvhrInstruction::operator=(const M480MvhrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MvhOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480MvhrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480MvhrInstruction dynRhs = 
      dynamic_cast<const M480MvhrInstruction&> (rhs); 
    return (getLineNum() == dynRhs.getLineNum());
  }
  
  void 
  M480MvhrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
