testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480MvrhInstruction
  //---------------------------------------------
  
  M480MvrhInstruction&
  M480MvrhInstruction::operator=(const M480MvrhInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MvhOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480MvrhInstruction::equalTo(const LlirNode& rhs) const
  {
    M480MvrhInstruction dynRhs = 
      dynamic_cast<const M480MvrhInstruction&> (rhs); 
    return (getLineNum() == dynRhs.getLineNum());
  }
  
  void 
  M480MvrhInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480UnlinkInstruction
  //---------------------------------------------
  
  M480UnlinkInstruction&
  M480UnlinkInstruction::operator=(const M480UnlinkInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480UnlinkInstruction::equalTo(const LlirNode& rhs) const
  {
    M480UnlinkInstruction dynRhs = 
      dynamic_cast<const M480UnlinkInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
	    && (getRegs()    == dynRhs.getRegs()   ) );
  }
  
  void 
  M480UnlinkInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480LinkInstruction
  //---------------------------------------------
  
  M480LinkInstruction&
  M480LinkInstruction::operator=(const M480LinkInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLinkInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LinkInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LinkInstruction dynRhs = 
      dynamic_cast<const M480LinkInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LinkInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480LinksInstruction
  //---------------------------------------------
  
  M480LinksInstruction&
  M480LinksInstruction::operator=(const M480LinksInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLinkInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LinksInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LinksInstruction dynRhs = 
      dynamic_cast<const M480LinksInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LinksInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
    
  
  //---------------------------------------------
  // M480LinkspInstruction
  //---------------------------------------------
  
  M480LinkspInstruction&
  M480LinkspInstruction::operator=(const M480LinkspInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLinkInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LinkspInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LinkspInstruction dynRhs = 
      dynamic_cast<const M480LinkspInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LinkspInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
     
  
  //---------------------------------------------
  // M480LinksplInstruction
  //---------------------------------------------
  
  M480LinksplInstruction&
  M480LinksplInstruction::operator=(const M480LinksplInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLinkInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LinksplInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LinksplInstruction dynRhs = 
      dynamic_cast<const M480LinksplInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LinksplInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

   
  
  //---------------------------------------------
  // M480LinksrInstruction
  //---------------------------------------------
  
  M480LinksrInstruction&
  M480LinksrInstruction::operator=(const M480LinksrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLinkInstruction::operator=(rhs);
    return *this;
    
