testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  bool
  M480LinksrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LinksrInstruction dynRhs = 
      dynamic_cast<const M480LinksrInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LinksrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480LinksdInstruction
  //---------------------------------------------
  
  M480LinksdInstruction&
  M480LinksdInstruction::operator=(const M480LinksdInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLinkInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LinksdInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LinksdInstruction dynRhs = 
      dynamic_cast<const M480LinksdInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LinksdInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480LinkccInstruction
  //---------------------------------------------
  
  M480LinkccInstruction&
  M480LinkccInstruction::operator=(const M480LinkccInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLinkInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LinkccInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LinkccInstruction dynRhs = 
      dynamic_cast<const M480LinkccInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LinkccInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480LinkcclInstruction
  //---------------------------------------------
  
  M480LinkcclInstruction&
  M480LinkcclInstruction::operator=(const M480LinkcclInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLinkInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LinkcclInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LinkcclInstruction dynRhs = 
      dynamic_cast<const M480LinkcclInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LinkcclInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
 
  //---------------------------------------------
  // M480LinksioInstruction
  //---------------------------------------------
  
  M480LinksioInstruction&
  M480LinksioInstruction::operator=(const M480LinksioInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLinkInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LinksioInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LinksioInstruction dynRhs = 
      dynamic_cast<const M480LinksioInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LinksioInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480LmmInstruction
  //---------------------------------------------
  
  M480LmmInstruction&
  M480LmmInstruction::operator=(const M480LmmInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLoadInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LmmInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LmmInstruction dynRhs = 
      dynamic_cast<const M480LmmInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LmmInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  

  //---------------------------------------------
  // M480LmmspInstruction
  //---------------------------------------------
  
  M480LmmspInstruction&
  M480LmmspInstruction::operator=(const M480LmmspInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLoadInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LmmspInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LmmspInstruction dynRhs = 
      dynamic_cast<const M480LmmspInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LmmspInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
