testhound/alo/llir/octave/m480/M480Instructions.cpp
  }

  //---------------------------------------------
  // M480LmmsplInstruction
  //---------------------------------------------
  
  M480LmmsplInstruction&
  M480LmmsplInstruction::operator=(const M480LmmsplInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLoadInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LmmsplInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LmmsplInstruction dynRhs = 
      dynamic_cast<const M480LmmsplInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LmmsplInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  

  //---------------------------------------------
  // M480LmmsrInstruction
  //---------------------------------------------
  
  M480LmmsrInstruction&
  M480LmmsrInstruction::operator=(const M480LmmsrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLoadInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LmmsrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LmmsrInstruction dynRhs = 
      dynamic_cast<const M480LmmsrInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LmmsrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  

  //---------------------------------------------
  // M480LmmsdInstruction
  //---------------------------------------------
  
  M480LmmsdInstruction&
  M480LmmsdInstruction::operator=(const M480LmmsdInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLoadInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LmmsdInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LmmsdInstruction dynRhs = 
      dynamic_cast<const M480LmmsdInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LmmsdInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  

  //---------------------------------------------
  // M480LmmccInstruction
  //---------------------------------------------
  
  M480LmmccInstruction&
  M480LmmccInstruction::operator=(const M480LmmccInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLoadInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LmmccInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LmmccInstruction dynRhs = 
      dynamic_cast<const M480LmmccInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LmmccInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480LmmcclInstruction
  //---------------------------------------------
  
  M480LmmcclInstruction&
  M480LmmcclInstruction::operator=(const M480LmmcclInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLoadInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LmmcclInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LmmcclInstruction dynRhs = 
      dynamic_cast<const M480LmmcclInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LmmcclInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480LmmsiInstruction
  //---------------------------------------------
  
  M480LmmsiInstruction&
  M480LmmsiInstruction::operator=(const M480LmmsiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLoadInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LmmsiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LmmsiInstruction dynRhs = 
      dynamic_cast<const M480LmmsiInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LmmsiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480LmmsInstruction
  //---------------------------------------------
  
  M480LmmsInstruction&
  M480LmmsInstruction::operator=(const M480LmmsInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
