testhound/alo/llir/octave/m480/M480Instructions.cpp
    MultiRegLoadInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LmmsInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LmmsInstruction dynRhs = 
      dynamic_cast<const M480LmmsInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LmmsInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480LspInstruction
  //---------------------------------------------
  
  M480LspInstruction&
  M480LspInstruction::operator=(const M480LspInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegLoadInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480LspInstruction::equalTo(const LlirNode& rhs) const
  {
    M480LspInstruction dynRhs = 
      dynamic_cast<const M480LspInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRegs()     == dynRhs.getRegs()    )
            && (getMem()      == dynRhs.getMem()     )
            && (getLinkFlag() == dynRhs.getLinkFlag()) );
  }
  
  void 
  M480LspInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480SmmInstruction
  //---------------------------------------------
  
  M480SmmInstruction&
  M480SmmInstruction::operator=(const M480SmmInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegStoreInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480SmmInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SmmInstruction dynRhs = 
      dynamic_cast<const M480SmmInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getRegs()    == dynRhs.getRegs()   )
            && (getMem()     == dynRhs.getMem()    ) );
  }
  
  void 
  M480SmmInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480SmmspInstruction
  //---------------------------------------------
  
  M480SmmspInstruction&
  M480SmmspInstruction::operator=(const M480SmmspInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegStoreInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480SmmspInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SmmspInstruction dynRhs = 
      dynamic_cast<const M480SmmspInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getRegs()    == dynRhs.getRegs()   )
            && (getMem()     == dynRhs.getMem()    ) );
  }
  
  void 
  M480SmmspInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480SmmsplInstruction
  //---------------------------------------------
  
  M480SmmsplInstruction&
  M480SmmsplInstruction::operator=(const M480SmmsplInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegStoreInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480SmmsplInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SmmsplInstruction dynRhs = 
      dynamic_cast<const M480SmmsplInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getRegs()    == dynRhs.getRegs()   )
            && (getMem()     == dynRhs.getMem()    ) );
  }
  
  void 
  M480SmmsplInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  

  //---------------------------------------------
  // M480SmmsrInstruction
  //---------------------------------------------
  
  M480SmmsrInstruction&
  M480SmmsrInstruction::operator=(const M480SmmsrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegStoreInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480SmmsrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SmmsrInstruction dynRhs = 
      dynamic_cast<const M480SmmsrInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getRegs()    == dynRhs.getRegs()   )
            && (getMem()     == dynRhs.getMem()    ) );
  }
  
  void 
  M480SmmsrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480SmmsdInstruction
  //---------------------------------------------
  
  M480SmmsdInstruction&
  M480SmmsdInstruction::operator=(const M480SmmsdInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegStoreInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480SmmsdInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SmmsdInstruction dynRhs = 
      dynamic_cast<const M480SmmsdInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getRegs()    == dynRhs.getRegs()   )
            && (getMem()     == dynRhs.getMem()    ) );
  }
  
  void 
  M480SmmsdInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
