testhound/alo/llir/octave/m480/M480Instructions.cpp
  }

  //---------------------------------------------
  // M480SmmccInstruction
  //---------------------------------------------
  
  M480SmmccInstruction&
  M480SmmccInstruction::operator=(const M480SmmccInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegStoreInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480SmmccInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SmmccInstruction dynRhs = 
      dynamic_cast<const M480SmmccInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getRegs()    == dynRhs.getRegs()   )
            && (getMem()     == dynRhs.getMem()    ) );
  }
  
  void 
  M480SmmccInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480SmmcclInstruction
  //---------------------------------------------
  
  M480SmmcclInstruction&
  M480SmmcclInstruction::operator=(const M480SmmcclInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegStoreInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480SmmcclInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SmmcclInstruction dynRhs = 
      dynamic_cast<const M480SmmcclInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getRegs()    == dynRhs.getRegs()   )
            && (getMem()     == dynRhs.getMem()    ) );
  }
  
  void 
  M480SmmcclInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480SmmsiInstruction
  //---------------------------------------------
  
  M480SmmsiInstruction&
  M480SmmsiInstruction::operator=(const M480SmmsiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegStoreInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480SmmsiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SmmsiInstruction dynRhs = 
      dynamic_cast<const M480SmmsiInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getRegs()    == dynRhs.getRegs()   )
            && (getMem()     == dynRhs.getMem()    ) );
  }
  
  void 
  M480SmmsiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480SmmsInstruction
  //---------------------------------------------
  
  M480SmmsInstruction&
  M480SmmsInstruction::operator=(const M480SmmsInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegStoreInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480SmmsInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SmmsInstruction dynRhs = 
      dynamic_cast<const M480SmmsInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getRegs()    == dynRhs.getRegs()   )
            && (getMem()     == dynRhs.getMem()    ) );
  }
  
  void 
  M480SmmsInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  
  
  //---------------------------------------------
  // M480SspInstruction
  //---------------------------------------------
  
  M480SspInstruction&
  M480SspInstruction::operator=(const M480SspInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    MultiRegStoreInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480SspInstruction::equalTo(const LlirNode& rhs) const
  {
    M480SspInstruction dynRhs = 
      dynamic_cast<const M480SspInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getRegs()    == dynRhs.getRegs()   )
            && (getMem()     == dynRhs.getMem()    ) );
  }
  
  void 
  M480SspInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480PutcInstruction
  //---------------------------------------------
  
  M480PutcInstruction&
  M480PutcInstruction::operator=(const M480PutcInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    TssRcOpInstruction::operator=(rhs);
    m_rsb = rhs.m_rsb;
    return *this;
    
  }
   
  RegPtr
  M480PutcInstruction::getRsb() const
  {
    return m_rsb;
  }
  
  bool
  M480PutcInstruction::equalTo(const LlirNode& rhs) const
  {
    M480PutcInstruction dynRhs = 
      dynamic_cast<const M480PutcInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRsa()      == dynRhs.getRsa()     )
            && (getRsb()      == dynRhs.getRsb()     )
            && (getTssFlags() == dynRhs.getTssFlags()) );
  }
  
  void 
  M480PutcInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480PutmInstruction
  //---------------------------------------------
  
  M480PutmInstruction&
  M480PutmInstruction::operator=(const M480PutmInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    TssRcOpInstruction::operator=(rhs);
    m_rsb = rhs.m_rsb;
    return *this;
    
