testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
   
  RegPtr
  M480PutmInstruction::getRsb() const
  {
    return m_rsb;
  }
  
  bool
  M480PutmInstruction::equalTo(const LlirNode& rhs) const
  {
    M480PutmInstruction dynRhs = 
      dynamic_cast<const M480PutmInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRsa()      == dynRhs.getRsa()     )
            && (getRsb()      == dynRhs.getRsb()     )
            && (getTssFlags() == dynRhs.getTssFlags()) );
  }
  
  void 
  M480PutmInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480PutpInstruction
  //---------------------------------------------
  
  M480PutpInstruction&
  M480PutpInstruction::operator=(const M480PutpInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    TssRcOpInstruction::operator=(rhs);
    m_rsb = rhs.m_rsb;
    return *this;
    
  }
   
  RegPtr
  M480PutpInstruction::getRsb() const
  {
    return m_rsb;
  }
  
  bool
  M480PutpInstruction::equalTo(const LlirNode& rhs) const
  {
    M480PutpInstruction dynRhs = 
      dynamic_cast<const M480PutpInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRsa()      == dynRhs.getRsa()     )
            && (getRsb()      == dynRhs.getRsb()     )
            && (getTssFlags() == dynRhs.getTssFlags()) );
  }
  
  void 
  M480PutpInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480PutdInstruction
  //---------------------------------------------
  
  M480PutdInstruction&
  M480PutdInstruction::operator=(const M480PutdInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    TssRcOpInstruction::operator=(rhs);
    m_rsb = rhs.m_rsb;
    return *this;
    
  }
   
  RegPtr
  M480PutdInstruction::getRsb() const
  {
    return m_rsb;
  }
  
  bool
  M480PutdInstruction::equalTo(const LlirNode& rhs) const
  {
    M480PutdInstruction dynRhs = 
      dynamic_cast<const M480PutdInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRsa()      == dynRhs.getRsa()     )
            && (getRsb()      == dynRhs.getRsb()     )
            && (getTssFlags() == dynRhs.getTssFlags()) );
  }
  
  void 
  M480PutdInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480GetInstruction
  //---------------------------------------------
  
  M480GetInstruction&
  M480GetInstruction::operator=(const M480GetInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    TssRcOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480GetInstruction::equalTo(const LlirNode& rhs) const
  {
    M480GetInstruction dynRhs = 
      dynamic_cast<const M480GetInstruction&> (rhs); 
    return (   (getLineNum()  == dynRhs.getLineNum() )
            && (getRsa()      == dynRhs.getRsa()     )
            && (getTssFlags() == dynRhs.getTssFlags()) );
  }
  
  void 
  M480GetInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480BcdrInstruction
  //---------------------------------------------

  bool 
  M480BcdrInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BcdrInstruction::getNumDelaySlots() const
  {
    if(hasValidCFlag())
      {
	return 0;
      }
    else
      {
	return 2;
      }
  }
  

  M480BcdrInstruction&
  M480BcdrInstruction::operator=(const M480BcdrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CondBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480BcdrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BcdrInstruction dynRhs = 
      dynamic_cast<const M480BcdrInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getEss()     == dynRhs.getEss()    )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getFlags()   == dynRhs.getFlags()  ) );
  }
  
  void 
  M480BcdrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480JbcdrInstruction
  //---------------------------------------------

  bool 
  M480JbcdrInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480JbcdrInstruction::getNumDelaySlots() const
  {
    if(hasValidCFlag())
      {
	return 0;
      }
    else
      {
	return 2;
      }
  }
  
  
  OpndPtr
  M480JbcdrInstruction::getTargetLabelList() const
  {
    return m_targetList;
  }
  

  M480JbcdrInstruction&
  M480JbcdrInstruction::operator=(const M480JbcdrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;

    m_targetList = rhs.m_targetList;
    CondBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JbcdrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbcdrInstruction dynRhs = 
      dynamic_cast<const M480JbcdrInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getEss()     == dynRhs.getEss()    )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getFlags()   == dynRhs.getFlags()  ) );
  }
  
  void 
  M480JbcdrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
