testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  //---------------------------------------------
  // M480BcrInstruction
  //---------------------------------------------


  bool 
  M480BcrInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BcrInstruction::getNumDelaySlots() const
  {
    if(hasValidCFlag())
      {
	return 0;
      }
    else
      {
	return 1;
      }

  }
  

  M480BcrInstruction&
  M480BcrInstruction::operator=(const M480BcrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CondBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480BcrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BcrInstruction dynRhs = 
      dynamic_cast<const M480BcrInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getEss()     == dynRhs.getEss()    )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getFlags()   == dynRhs.getFlags()  ) );
  }
  
  void 
  M480BcrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
    
  //---------------------------------------------
  // M480JbcrInstruction
  //---------------------------------------------
  unsigned int
  M480JbcrInstruction::getNumDelaySlots() const
  {
    if(hasValidCFlag())
      {
	return 0;
      }
    else
      {
	return 1;
      }

  }
  

  bool 
  M480JbcrInstruction::isPseudoInsn() const
  {
    return true;
  }

 
  M480JbcrInstruction&
  M480JbcrInstruction::operator=(const M480JbcrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;

    m_targetList = rhs.m_targetList;
    CondBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
    
  OpndPtr
  M480JbcrInstruction::getTargetLabelList() const
  {
    return m_targetList;
  }
  
  bool
  M480JbcrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbcrInstruction dynRhs = 
      dynamic_cast<const M480JbcrInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getEss()     == dynRhs.getEss()    )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getFlags()   == dynRhs.getFlags()  ) );
  }
  
  void 
  M480JbcrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480BcdiInstruction
  //---------------------------------------------
  

  bool 
  M480BcdiInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BcdiInstruction::getNumDelaySlots() const
  {
    if(hasValidCFlag())
      {
	return 0;
      }
    else
      {
	return 2;
      }
  }


  M480BcdiInstruction&
  M480BcdiInstruction::operator=(const M480BcdiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CondBranchImmedInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480BcdiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BcdiInstruction dynRhs = 
      dynamic_cast<const M480BcdiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getEss()     == dynRhs.getEss()    )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getFlags()   == dynRhs.getFlags()  ) );
  }
  
  void 
  M480BcdiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
    
  //---------------------------------------------
  // M480JbcdiInstruction
  //---------------------------------------------
  

  bool 
  M480JbcdiInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480JbcdiInstruction::getNumDelaySlots() const
  {
    if(hasValidCFlag())
      {
	return 0;
      }
    else
      {
	return 2;
      }
  }


  M480JbcdiInstruction&
  M480JbcdiInstruction::operator=(const M480JbcdiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CondBranchImmedInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JbcdiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbcdiInstruction dynRhs = 
      dynamic_cast<const M480JbcdiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getEss()     == dynRhs.getEss()    )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getFlags()   == dynRhs.getFlags()  ) );
  }
  
  void 
  M480JbcdiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480BciInstruction
  //---------------------------------------------


  bool 
  M480BciInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BciInstruction::getNumDelaySlots() const
  {
    if(hasValidCFlag())
      {
	return 0;
      }
    else
      {
	return 1;
      }

  }

  
  M480BciInstruction&
  M480BciInstruction::operator=(const M480BciInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CondBranchImmedInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480BciInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BciInstruction dynRhs = 
      dynamic_cast<const M480BciInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getEss()     == dynRhs.getEss()    )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getFlags()   == dynRhs.getFlags()  ) );
  }
  
  void 
  M480BciInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
