testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
    
  //---------------------------------------------
  // M480JbciInstruction
  //---------------------------------------------


  bool 
  M480JbciInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JbciInstruction::getNumDelaySlots() const
  {
   if(hasValidCFlag())
      {
	return 0;
      }
    else
      {
	return 1;
      }
  }

  
  M480JbciInstruction&
  M480JbciInstruction::operator=(const M480JbciInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CondBranchImmedInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JbciInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbciInstruction dynRhs = 
      dynamic_cast<const M480JbciInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getEss()     == dynRhs.getEss()    )
	     && (getDst()     == dynRhs.getDst()    )
	     && (getFlags()   == dynRhs.getFlags()  ) );
  }
  
  void 
  M480JbciInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480BnzrInstruction
  //---------------------------------------------


  bool 
  M480BnzrInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BnzrInstruction::getNumDelaySlots() const
  {
    return 2;
  }

  

  M480BnzrInstruction&
  M480BnzrInstruction::operator=(const M480BnzrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    ZeroBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480BnzrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BnzrInstruction dynRhs = 
      dynamic_cast<const M480BnzrInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getCmpReg() == dynRhs.getCmpReg()));
  }
  
  void 
  M480BnzrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
    
  //---------------------------------------------
  // M480JbnzrInstruction
  //---------------------------------------------


  bool 
  M480JbnzrInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JbnzrInstruction::getNumDelaySlots() const
  {
    return 2;
  }
  
  OpndPtr
  M480JbnzrInstruction::getTargetLabelList() const
  {
    return m_targetList;
  }
  

  M480JbnzrInstruction&
  M480JbnzrInstruction::operator=(const M480JbnzrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    m_targetList = rhs.m_targetList;
    ZeroBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JbnzrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbnzrInstruction dynRhs = 
      dynamic_cast<const M480JbnzrInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getCmpReg() == dynRhs.getCmpReg()));
  }
  
  void 
  M480JbnzrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480BzrInstruction
  //---------------------------------------------


  bool 
  M480BzrInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BzrInstruction::getNumDelaySlots() const
  {
    return 2;
  }

  

  M480BzrInstruction&
  M480BzrInstruction::operator=(const M480BzrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    ZeroBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480BzrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BzrInstruction dynRhs = 
      dynamic_cast<const M480BzrInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getCmpReg() == dynRhs.getCmpReg()));
  }
  
  void 
  M480BzrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
    
  //---------------------------------------------
  // M480JbzrInstruction
  //---------------------------------------------


  bool 
  M480JbzrInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JbzrInstruction::getNumDelaySlots() const
  {
    return 2;
  }

  OpndPtr
  M480JbzrInstruction::getTargetLabelList() const
  {
    return m_targetList;
  }

  M480JbzrInstruction&
  M480JbzrInstruction::operator=(const M480JbzrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    m_targetList = rhs.m_targetList;
    ZeroBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JbzrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbzrInstruction dynRhs = 
      dynamic_cast<const M480JbzrInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getCmpReg() == dynRhs.getCmpReg()));
  }
  
  void 
  M480JbzrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
