testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480BnziInstruction
  //---------------------------------------------
  

  bool 
  M480BnziInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BnziInstruction::getNumDelaySlots() const
  {
    return 2;
  }




  M480BnziInstruction&
  M480BnziInstruction::operator=(const M480BnziInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    ZeroBranchImmedInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480BnziInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BnziInstruction dynRhs = 
      dynamic_cast<const M480BnziInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getCmpReg() == dynRhs.getCmpReg()));
  }
  
  void 
  M480BnziInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
    
  //---------------------------------------------
  // M480JbnziInstruction
  //---------------------------------------------
  

  bool 
  M480JbnziInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JbnziInstruction::getNumDelaySlots() const
  {
    return 2;
  }




  M480JbnziInstruction&
  M480JbnziInstruction::operator=(const M480JbnziInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    ZeroBranchImmedInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JbnziInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbnziInstruction dynRhs = 
      dynamic_cast<const M480JbnziInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   )
	     && (getCmpReg() == dynRhs.getCmpReg()));
  }
  
  void 
  M480JbnziInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480BziInstruction
  //---------------------------------------------
  

  bool 
  M480BziInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BziInstruction::getNumDelaySlots() const
  {
    return 2;
  }



  M480BziInstruction&
  M480BziInstruction::operator=(const M480BziInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    ZeroBranchImmedInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480BziInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BziInstruction dynRhs = 
      dynamic_cast<const M480BziInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   ) 
	     && (getCmpReg() == dynRhs.getCmpReg()));
  }
  
  void 
  M480BziInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
   
  //---------------------------------------------
  // M480JbziInstruction
  //---------------------------------------------
  

  bool 
  M480JbziInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JbziInstruction::getNumDelaySlots() const
  {
    return 2;
  }



  M480JbziInstruction&
  M480JbziInstruction::operator=(const M480JbziInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    ZeroBranchImmedInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JbziInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbziInstruction dynRhs = 
      dynamic_cast<const M480JbziInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getSrc2()    == dynRhs.getSrc2()   ) 
	     && (getCmpReg() == dynRhs.getCmpReg()));
  }
  
  void 
  M480JbziInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480TsetbInstruction
  //---------------------------------------------
  
  M480TsetbInstruction&
  M480TsetbInstruction::operator=(const M480TsetbInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    TestBitBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480TsetbInstruction::equalTo(const LlirNode& rhs) const
  {
    M480TsetbInstruction dynRhs = 
      dynamic_cast<const M480TsetbInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getBitpos()  == dynRhs.getBitpos() )
	     && (getDisp()    == dynRhs.getDisp()   ) );
  }
  
  void 
  M480TsetbInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480JtsetbInstruction
  //---------------------------------------------

  bool 
  M480JtsetbInstruction::isPseudoInsn() const
  {
    return true;
  }

  M480JtsetbInstruction&
  M480JtsetbInstruction::operator=(const M480JtsetbInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    TestBitBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JtsetbInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JtsetbInstruction dynRhs = 
      dynamic_cast<const M480JtsetbInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getBitpos()  == dynRhs.getBitpos() )
	     && (getDisp()    == dynRhs.getDisp()   ) );
  }
  
  void 
  M480JtsetbInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
