testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  

  
  //---------------------------------------------
  // M480TclrbInstruction
  //---------------------------------------------
  
  M480TclrbInstruction&
  M480TclrbInstruction::operator=(const M480TclrbInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    TestBitBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480TclrbInstruction::equalTo(const LlirNode& rhs) const
  {
    M480TclrbInstruction dynRhs = 
      dynamic_cast<const M480TclrbInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getBitpos()  == dynRhs.getBitpos() )
	     && (getDisp()    == dynRhs.getDisp()   ) );
  }
  
  void 
  M480TclrbInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  

  
  //---------------------------------------------
  // M480JtclrbInstruction
  //---------------------------------------------
  

  bool 
  M480JtclrbInstruction::isPseudoInsn() const
  {
    return true;
  }

  M480JtclrbInstruction&
  M480JtclrbInstruction::operator=(const M480JtclrbInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    TestBitBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JtclrbInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JtclrbInstruction dynRhs = 
      dynamic_cast<const M480JtclrbInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getSrc1()    == dynRhs.getSrc1()   )
	     && (getBitpos()  == dynRhs.getBitpos() )
	     && (getDisp()    == dynRhs.getDisp()   ) );
  }
  
  void 
  M480JtclrbInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  

  
  //---------------------------------------------
  // M480RnmiInstruction
  //---------------------------------------------
  

  bool 
  M480RnmiInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480RnmiInstruction::getNumDelaySlots() const
  {
    return 1;
  }


  M480RnmiInstruction&
  M480RnmiInstruction::operator=(const M480RnmiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    ReturnOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480RnmiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480RnmiInstruction dynRhs = 
      dynamic_cast<const M480RnmiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getDiFlag()  == dynRhs.getDiFlag() ) );
  }
  
  void 
  M480RnmiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  
  //---------------------------------------------
  // M480JrnmiInstruction
  //---------------------------------------------
  

  bool 
  M480JrnmiInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JrnmiInstruction::getNumDelaySlots() const
  {
    return 1;
  }


  M480JrnmiInstruction&
  M480JrnmiInstruction::operator=(const M480JrnmiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    ReturnOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JrnmiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JrnmiInstruction dynRhs = 
      dynamic_cast<const M480JrnmiInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getDiFlag()  == dynRhs.getDiFlag() ) );
  }
  
  void 
  M480JrnmiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  


  //---------------------------------------------
  // M480RintInstruction
  //---------------------------------------------


  bool 
  M480RintInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480RintInstruction::getNumDelaySlots() const
  {
    return 1;
  }

  

  M480RintInstruction&
  M480RintInstruction::operator=(const M480RintInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    ReturnOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480RintInstruction::equalTo(const LlirNode& rhs) const
  {
    M480RintInstruction dynRhs = 
      dynamic_cast<const M480RintInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getDiFlag()  == dynRhs.getDiFlag() ) );
  }
  
  void 
  M480RintInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
    


  //---------------------------------------------
  // M480JrintInstruction
  //---------------------------------------------


  bool 
  M480JrintInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JrintInstruction::getNumDelaySlots() const
  {
    return 1;
  }

  

  M480JrintInstruction&
  M480JrintInstruction::operator=(const M480JrintInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    ReturnOpInstruction::operator=(rhs);
    return *this;
    
  }
  
  
  bool
  M480JrintInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JrintInstruction dynRhs = 
      dynamic_cast<const M480JrintInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getDiFlag()  == dynRhs.getDiFlag() ) );
  }
  
  void 
  M480JrintInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
