testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  


  //---------------------------------------------
  // M480BrsInstruction
  //---------------------------------------------

  bool 
  M480BrsInstruction::isReturnInsn() const
  {
    return true;
  }

  bool
  M480BrsInstruction::isBranchInsn() const
  {
    return true;
  }

  bool
  M480BrsInstruction::isValidDslotInsn() const
  {
    return false;
  }

  bool
  M480BrsInstruction::isCallInsn() const
  {
    if(hasReturnReg())
      {
	return true;
      }
    else
      {
	return false;
      }
  }

  bool
  M480BrsInstruction::hasReturnReg() const
  {
    if(! getDst()->isNullOperand())
      {
	shared_ptr<const Register> rpc = shared_dynamic_cast<const Register>(getDst());

	unsigned int rpcRegNum = rpc->getRegNum();
	    
	if(rpcRegNum == 60 ||
	   rpcRegNum == 61 ||
	   rpcRegNum == 62)
	  {
	    return true;
	  }
      }

    return false;
  }

  bool 
  M480BrsInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BrsInstruction::getNumDelaySlots() const
  {
    return 1;
  }

  
  OpndPtr
  M480BrsInstruction::getDst() const
  {
    return m_dst;
  }
  
  M480BrsInstruction&
  M480BrsInstruction::operator=(const M480BrsInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BranchOpInstruction::operator=(rhs);
    m_dst = rhs.m_dst;
    return *this;
    
  }
  
  bool
  M480BrsInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BrsInstruction dynRhs = 
      dynamic_cast<const M480BrsInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getDst()     == dynRhs.getDst()    ) );
  }
  
  void 
  M480BrsInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  


  //---------------------------------------------
  // M480JbrsInstruction
  //---------------------------------------------

  bool 
  M480JbrsInstruction::isReturnInsn() const
  {
    return true;
  }

  bool
  M480JbrsInstruction::isBranchInsn() const
  {
    return true;
  }

  bool
  M480JbrsInstruction::isValidDslotInsn() const
  {
    return false;
  }

  bool
  M480JbrsInstruction::hasReturnReg() const
  {
    if(! getDst()->isNullOperand())
      {
	shared_ptr<const Register> rpc = shared_dynamic_cast<const Register>(getDst());

	unsigned int rpcRegNum = rpc->getRegNum();
	    
	if(rpcRegNum == 60 ||
	   rpcRegNum == 61 ||
	   rpcRegNum == 62)
	  {
	    return true;
	  }
      }

    return false;
  }

  bool
  M480JbrsInstruction::isCallInsn() const
  {
    if(hasReturnReg())
      {
	return false;
      }
    else
      {
	return true;
      }
  }

  bool 
  M480JbrsInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JbrsInstruction::getNumDelaySlots() const
  {
    return 1;
  }

  
  OpndPtr
  M480JbrsInstruction::getDst() const
  {
    return m_dst;
  }
  
  M480JbrsInstruction&
  M480JbrsInstruction::operator=(const M480JbrsInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BranchOpInstruction::operator=(rhs);
    m_dst = rhs.m_dst;
    return *this;
    
  }
  
  bool
  M480JbrsInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbrsInstruction dynRhs = 
      dynamic_cast<const M480JbrsInstruction&> (rhs); 
    return (    (getLineNum() == dynRhs.getLineNum())
	     && (getDst()     == dynRhs.getDst()    ) );
  }
  
  void 
  M480JbrsInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  

  
  //---------------------------------------------
  // M480BrslInstruction
  //---------------------------------------------
  
  bool 
  M480BrslInstruction::isReturnInsn() const
  {
    return true;
  }

  bool
  M480BrslInstruction::isBranchInsn() const
  {
    return true;
  }

  bool
  M480BrslInstruction::isValidDslotInsn() const
  {
    return false;
  }

  bool 
  M480BrslInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BrslInstruction::getNumDelaySlots() const
  {
    return 1;
  }


  OpndPtr
  M480BrslInstruction::getBrslFlags() const
  {
    return m_flags;
  }
  
  M480BrslInstruction&
  M480BrslInstruction::operator=(const M480BrslInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BranchOpInstruction::operator=(rhs);
    m_flags = rhs.m_flags;
    return *this;
    
  }
  
  bool
  M480BrslInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BrslInstruction dynRhs = 
      dynamic_cast<const M480BrslInstruction&> (rhs); 
    return (    (getLineNum()   == dynRhs.getLineNum()  )
	     && (getBrslFlags() == dynRhs.getBrslFlags()) );
  }
  
  void 
  M480BrslInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  
  //---------------------------------------------
  // M480JbrslInstruction
  //---------------------------------------------
  
  bool 
  M480JbrslInstruction::isReturnInsn() const
  {
    return true;
  }

  bool
  M480JbrslInstruction::isBranchInsn() const
  {
    return true;
  }

  bool
  M480JbrslInstruction::isValidDslotInsn() const
  {
    return false;
  }

  bool 
  M480JbrslInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JbrslInstruction::getNumDelaySlots() const
  {
    return 1;
  }


  OpndPtr
  M480JbrslInstruction::getBrslFlags() const
  {
    return m_flags;
  }
  
  M480JbrslInstruction&
  M480JbrslInstruction::operator=(const M480JbrslInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BranchOpInstruction::operator=(rhs);
    m_flags = rhs.m_flags;
    return *this;
    
  }
  
  bool
  M480JbrslInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbrslInstruction dynRhs = 
      dynamic_cast<const M480JbrslInstruction&> (rhs); 
    return (    (getLineNum()   == dynRhs.getLineNum()  )
	     && (getBrslFlags() == dynRhs.getBrslFlags()) );
  }
  
  void 
  M480JbrslInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
