testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  //---------------------------------------------
  // M480BrspreInstruction
  //---------------------------------------------

  bool 
  M480BrspreInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BrspreInstruction::getNumDelaySlots() const
  {
    return 0;
  }

  bool
  M480BrspreInstruction::isAbcInsn() const
  {
    return false;
  }
    
  bool
  M480BrspreInstruction::isValidDslotInsn() const
  {
    return true;
  }
  
  OctaveInstruction::BranchProbability 
  M480BrspreInstruction::getBranchProbability() const
  {
    return OctaveInstruction::NONE;
  }    

  M480BrspreInstruction&
  M480BrspreInstruction::operator=(const M480BrspreInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    OctaveInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480BrspreInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BrspreInstruction dynRhs = 
      dynamic_cast<const M480BrspreInstruction&> (rhs); 
    return (getLineNum() == dynRhs.getLineNum());
  }
  
  void 
  M480BrspreInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480CmpInstruction
  //---------------------------------------------
  
  M480CmpInstruction&
  M480CmpInstruction::operator=(const M480CmpInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CompareOpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480CmpInstruction::equalTo(const LlirNode& rhs) const
  {
    M480CmpInstruction dynRhs = 
      dynamic_cast<const M480CmpInstruction&> (rhs); 
    return (   (getLineNum()      == dynRhs.getLineNum()     )
            && (getSrc1()         == dynRhs.getSrc1()        )
	    && (getSrc2()         == dynRhs.getSrc2()        )
            && (getAbcFlag()      == dynRhs.getAbcFlag()     )
            && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480CmpInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480JcmpInstruction
  //---------------------------------------------
  
  M480JcmpInstruction&
  M480JcmpInstruction::operator=(const M480JcmpInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CompareOpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480JcmpInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JcmpInstruction dynRhs = 
      dynamic_cast<const M480JcmpInstruction&> (rhs); 
    return (   (getLineNum()      == dynRhs.getLineNum()     )
            && (getSrc1()         == dynRhs.getSrc1()        )
	    && (getSrc2()         == dynRhs.getSrc2()        )
            && (getAbcFlag()      == dynRhs.getAbcFlag()     )
            && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JcmpInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480CmpiInstruction
  //---------------------------------------------
  
  M480CmpiInstruction&
  M480CmpiInstruction::operator=(const M480CmpiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CompareOpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480CmpiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480CmpiInstruction dynRhs = 
      dynamic_cast<const M480CmpiInstruction&> (rhs); 
    return (   (getLineNum()      == dynRhs.getLineNum()     )
            && (getSrc1()         == dynRhs.getSrc1()        )
	    && (getSrc2()         == dynRhs.getSrc2()        )
            && (getAbcFlag()      == dynRhs.getAbcFlag()     )
            && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480CmpiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480JcmpiInstruction
  //---------------------------------------------
  
  M480JcmpiInstruction&
  M480JcmpiInstruction::operator=(const M480JcmpiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CompareOpBranchInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480JcmpiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JcmpiInstruction dynRhs = 
      dynamic_cast<const M480JcmpiInstruction&> (rhs); 
    return (   (getLineNum()      == dynRhs.getLineNum()     )
            && (getSrc1()         == dynRhs.getSrc1()        )
	    && (getSrc2()         == dynRhs.getSrc2()        )
            && (getAbcFlag()      == dynRhs.getAbcFlag()     )
            && (getBranchTarget() == dynRhs.getBranchTarget()) );
  }
  
  void 
  M480JcmpiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480CmprInstruction
  //---------------------------------------------
  
  M480CmprInstruction&
  M480CmprInstruction::operator=(const M480CmprInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CompareOpSignInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480CmprInstruction::equalTo(const LlirNode& rhs) const
  {
    M480CmprInstruction dynRhs = 
      dynamic_cast<const M480CmprInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getSrc1()    == dynRhs.getSrc1()   )
	    && (getSrc2()    == dynRhs.getSrc2()   )
            && (getAbcFlag() == dynRhs.getAbcFlag())
            && (getDst()     == dynRhs.getDst()    ) 
            && (getSign()    == dynRhs.getSign()   ) );
  }
  
  void 
  M480CmprInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
