testhound/alo/llir/octave/m480/M480Instructions.cpp
  }
  
  
  //---------------------------------------------
  // M480CmpriInstruction
  //---------------------------------------------
  
  M480CmpriInstruction&
  M480CmpriInstruction::operator=(const M480CmpriInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    CompareOpSignInstruction::operator=(rhs);
    return *this;
    
  }
  
  bool
  M480CmpriInstruction::equalTo(const LlirNode& rhs) const
  {
    M480CmpriInstruction dynRhs = 
      dynamic_cast<const M480CmpriInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getSrc1()    == dynRhs.getSrc1()   )
	    && (getSrc2()    == dynRhs.getSrc2()   )
            && (getAbcFlag() == dynRhs.getAbcFlag())
            && (getDst()     == dynRhs.getDst()    ) 
            && (getSign()    == dynRhs.getSign()   ) );
  }
  
  void 
  M480CmpriInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  // M480BiInstruction
  //---------------------------------------------

  bool
  M480BiInstruction::isBranchInsn() const
  {
    return true;
  }

  bool
  M480BiInstruction::isValidDslotInsn() const
  {
    return false;
  }

  bool
  M480BiInstruction::isCallInsn() const
  {
    if(hasReturnReg())
      {
	return true;
      }
    else
      {
	return false;
      }
  }

  bool
  M480BiInstruction::hasReturnReg() const
  {
    if(! getDst()->isNullOperand())
      {
	shared_ptr<const Register> rpc = shared_dynamic_cast<const Register>(getDst());

	unsigned int rpcRegNum = rpc->getRegNum();
	    
	if(rpcRegNum == 60 ||
	   rpcRegNum == 61 ||
	   rpcRegNum == 62)
	  {
	    return true;
	  }
      }

    return false;
  }

  bool 
  M480BiInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BiInstruction::getNumDelaySlots() const
  {
    return 1;
  }


  OpndPtr
  M480BiInstruction::getSrc1() const
  {
    return m_src1;
  }
  
  OpndPtr
  M480BiInstruction::getDst() const
  {
    return m_dst;
  }
  
  OpndPtr
  M480BiInstruction::getCdFlag() const
  {
    return m_cdFlag;
  }
  
  M480BiInstruction&
  M480BiInstruction::operator=(const M480BiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BranchOpInstruction::operator=(rhs);
    m_src1   = rhs.m_src1;
    m_dst    = rhs.m_dst;
    m_cdFlag = rhs.m_cdFlag;
    return *this;
    
  }
  
  bool
  M480BiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BiInstruction dynRhs = 
      dynamic_cast<const M480BiInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getSrc1()    == dynRhs.getSrc1()   )
            && (getDst()     == dynRhs.getDst()    ) 
            && (getCdFlag()  == dynRhs.getCdFlag() ) );
  }
  
  void 
  M480BiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
    
  //---------------------------------------------
  // M480JbiInstruction
  //---------------------------------------------

  bool
  M480JbiInstruction::isBranchInsn() const
  {
    return true;
  }

  bool
  M480JbiInstruction::isValidDslotInsn() const
  {
    return false;
  }

  bool
  M480JbiInstruction::isCallInsn() const
  {
    if(hasReturnReg())
      {
	return true;
      }
    else
      {
	return false;
      }
  }

  bool
  M480JbiInstruction::hasReturnReg() const
  {
    if(! getDst()->isNullOperand())
      {
	shared_ptr<const Register> rpc = shared_dynamic_cast<const Register>(getDst());

	unsigned int rpcRegNum = rpc->getRegNum();
	    
	if(rpcRegNum == 60 ||
	   rpcRegNum == 61 ||
	   rpcRegNum == 62)
	  {
	    return true;
	  }
      }

    return false;
  }

  bool 
  M480JbiInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JbiInstruction::getNumDelaySlots() const
  {
    return 1;
  }

  OctaveInstruction::BranchProbability 
  M480JbiInstruction::getBranchProbability() const
  {
    return OctaveInstruction::TAKEN;
  }

  OpndPtr
  M480JbiInstruction::getSrc1() const
  {
    return m_src1;
  }
  
  OpndPtr
  M480JbiInstruction::getDst() const
  {
    return m_dst;
  }
  

  OpndPtr
  M480JbiInstruction::getCdFlag() const
  {
    return m_cdFlag;
  }
  
  M480JbiInstruction&
  M480JbiInstruction::operator=(const M480JbiInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BranchOpInstruction::operator=(rhs);
    m_src1   = rhs.m_src1;
    m_dst    = rhs.m_dst;
    m_cdFlag = rhs.m_cdFlag;
    return *this;
    
  }
  
  bool
  M480JbiInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbiInstruction dynRhs = 
      dynamic_cast<const M480JbiInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getSrc1()    == dynRhs.getSrc1()   )
            && (getDst()     == dynRhs.getDst()    ) 
            && (getCdFlag()  == dynRhs.getCdFlag() ) );
  }
  
  void 
  M480JbiInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  //---------------------------------------------
  // M480BrInstruction
  //---------------------------------------------
  
  bool 
  M480BrInstruction::isReturnInsn() const
  {
    if(! getSrc1()->isNullOperand())
      {
	unsigned int rpcRegNum = getSrc1()->getRegNum();
	
	if(rpcRegNum == 60 ||
	   rpcRegNum == 61 ||
	   rpcRegNum == 62)
	  {
	    return true;
	  }
      }

    return false;
  }

  bool
  M480BrInstruction::isBranchInsn() const
  {
    return true;
  }

  bool
  M480BrInstruction::isValidDslotInsn() const
  {
    return false;
  }

  bool
  M480BrInstruction::hasReturnReg() const
  {
    if(! getDst()->isNullOperand())
      {
	shared_ptr<const Register> rpc = shared_dynamic_cast<const Register>(getDst());

	unsigned int rpcRegNum = rpc->getRegNum();
	    
	if(rpcRegNum == 60 ||
	   rpcRegNum == 61 ||
	   rpcRegNum == 62)
	  {
	    return true;
	  }
      }

