testhound/alo/llir/octave/m480/M480Instructions.cpp
    return false;
  }

  bool
  M480BrInstruction::isCallInsn() const
  {
    if(hasReturnReg())
      {
	return true;
      }
    else
      {
	return false;
      }
  }

  bool 
  M480BrInstruction::isPseudoInsn() const
  {
    return false;
  }

  unsigned int
  M480BrInstruction::getNumDelaySlots() const
  {
    return 1;
  }


  RegPtr
  M480BrInstruction::getSrc1() const
  {
    return m_src1;
  }
  
  OpndPtr
  M480BrInstruction::getDst() const
  {
    return m_dst;
  }
  
  M480BrInstruction&
  M480BrInstruction::operator=(const M480BrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BranchOpInstruction::operator=(rhs);
    m_src1   = rhs.m_src1;
    m_dst    = rhs.m_dst;
    return *this;
    
  }
  
  bool
  M480BrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480BrInstruction dynRhs = 
      dynamic_cast<const M480BrInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getSrc1()    == dynRhs.getSrc1()   )
            && (getDst()     == dynRhs.getDst()    ) );
  }
  
  void 
  M480BrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480JtablebrInstruction
  //---------------------------------------------
    
  bool
  M480JtablebrInstruction::isBranchInsn() const
  {
    return true;
  }
 
  bool
  M480JtablebrInstruction::isValidDslotInsn() const
  {
    return false;
  }
 
  OctaveInstruction::BranchProbability 
  M480JtablebrInstruction::getBranchProbability() const
  {
    return OctaveInstruction::TAKEN;
  }

  bool 
  M480JtablebrInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JtablebrInstruction::getNumDelaySlots() const
  {
    return 1;
  }


  RegPtr
  M480JtablebrInstruction::getSrc1() const
  {
    return m_src1;
  }
  
  OpndPtr
  M480JtablebrInstruction::getDst() const
  {
    return m_dst;
  }
  
  M480JtablebrInstruction&
  M480JtablebrInstruction::operator=(const M480JtablebrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BranchOpInstruction::operator=(rhs);
    m_src1   = rhs.m_src1;
    m_dst    = rhs.m_dst;
    return *this;
    
  }
  
  bool
  M480JtablebrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JtablebrInstruction dynRhs = 
      dynamic_cast<const M480JtablebrInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getSrc1()    == dynRhs.getSrc1()   )
            && (getDst()     == dynRhs.getDst()    ) );
  }
  
  void 
  M480JtablebrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }


  //---------------------------------------------
  // M480JtableRelativebrInstruction
  //---------------------------------------------
    
  bool
  M480JtableRelativebrInstruction::isBranchInsn() const
  {
    return true;
  }

  bool
  M480JtableRelativebrInstruction::isValidDslotInsn() const
  {
    return false;
  }

  OctaveInstruction::BranchProbability 
  M480JtableRelativebrInstruction::getBranchProbability() const
  {
    return OctaveInstruction::TAKEN;
  }

  bool 
  M480JtableRelativebrInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JtableRelativebrInstruction::getNumDelaySlots() const
  {
    return 1;
  }


  RegPtr
  M480JtableRelativebrInstruction::getSrc1() const
  {
    return m_src1;
  }
  
  OpndPtr
  M480JtableRelativebrInstruction::getDst() const
  {
    return m_dst;
  }
  
  M480JtableRelativebrInstruction&
  M480JtableRelativebrInstruction::operator=(const M480JtableRelativebrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BranchOpInstruction::operator=(rhs);
    m_src1   = rhs.m_src1;
    m_dst    = rhs.m_dst;
    return *this;
    
  }
  
  bool
  M480JtableRelativebrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JtableRelativebrInstruction dynRhs = 
      dynamic_cast<const M480JtableRelativebrInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getSrc1()    == dynRhs.getSrc1()   )
            && (getDst()     == dynRhs.getDst()    ) );
  }
  
  void 
  M480JtableRelativebrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }

  //---------------------------------------------
  // M480JbrInstruction
  //---------------------------------------------
  
  bool 
  M480JbrInstruction::isReturnInsn() const
  {
    if(! getSrc1()->isNullOperand())
      {
	unsigned int rpcRegNum = getSrc1()->getRegNum();
	
	if(rpcRegNum == 60 ||
	   rpcRegNum == 61 ||
	   rpcRegNum == 62)
	  {
	    return true;
	  }
      }

    return false;
  }

  OctaveInstruction::BranchProbability 
  M480JbrInstruction::getBranchProbability() const
  {
    return OctaveInstruction::TAKEN;
  }

  bool
  M480JbrInstruction::isBranchInsn() const
  {
    return true;
  }

  bool
  M480JbrInstruction::isValidDslotInsn() const
  {
    return false;
  }

  bool
  M480JbrInstruction::isCallInsn() const
  {
    if(hasReturnReg())
      {
	return true;
      }
    else
      {
	return false;
      }
  }

  bool
  M480JbrInstruction::hasReturnReg() const
  {
    if(! getDst()->isNullOperand())
      {
	shared_ptr<const Register> rpc = shared_dynamic_cast<const Register>(getDst());

	unsigned int rpcRegNum = rpc->getRegNum();
	    
	if(rpcRegNum == 60 ||
	   rpcRegNum == 61 ||
	   rpcRegNum == 62)
	  {
	    return true;
	  }
      }

    return false;
  }


  bool 
  M480JbrInstruction::isPseudoInsn() const
  {
    return true;
  }

  unsigned int
  M480JbrInstruction::getNumDelaySlots() const
  {
    return 1;
  }


  RegPtr
  M480JbrInstruction::getSrc1() const
  {
    return m_src1;
  }
  
  OpndPtr
  M480JbrInstruction::getDst() const
  {
    return m_dst;
  }
  
  OpndPtr
  M480JbrInstruction::getTargetLabelList() const
  {
    return m_targetList;
  }
  
  M480JbrInstruction&
  M480JbrInstruction::operator=(const M480JbrInstruction& rhs)
  {
    if(this == &rhs)
      return *this;
    
    BranchOpInstruction::operator=(rhs);
    m_src1   = rhs.m_src1;
    m_dst    = rhs.m_dst;
    m_targetList = rhs.m_targetList;
    return *this;
    
  }
  
  bool
  M480JbrInstruction::equalTo(const LlirNode& rhs) const
  {
    M480JbrInstruction dynRhs = 
      dynamic_cast<const M480JbrInstruction&> (rhs); 
    return (   (getLineNum() == dynRhs.getLineNum())
            && (getSrc1()    == dynRhs.getSrc1()   )
            && (getDst()     == dynRhs.getDst()    ) );
  }
  
  void 
  M480JbrInstruction::accept(Visitor& v) const
  {
    if(M480Visitor *lv = 
       dynamic_cast<M480Visitor *>(&v)) 
      {
	lv->visit(*this);
      } 
    else
      {
	throw LLIR_INTERNAL_EXCEPTION("accept error");
      }       
    
  }
  
  
  //---------------------------------------------
  //---------------------------------------------

} // end of namespace Llir
